// +----------------------------------------------------------------------
// | 广西西途比网络科技有限公司 www.c2b666.com
// +----------------------------------------------------------------------
// | 功能描述: 默认配置
// +----------------------------------------------------------------------
// | 时　　间: 2019-11-19 09:27:38
// +----------------------------------------------------------------------
// | 代码创建: 朱荻 <292018748@qq.com>
// +----------------------------------------------------------------------
// | 版本信息: V1.0.0
// +----------------------------------------------------------------------
// | 代码修改:（侯武昌 - 2020-06-16）
// +----------------------------------------------------------------------
// | 修改内容: 修改登录地址
// +----------------------------------------------------------------------

export default {
  // 应用调试模式
  debug: false,
  // 打印调试信息
  trace: false,
  // 客户端信息
  client: {
    // 接口 APP ID
    clientId: 'sydltd_client',
    // 接口 APP SECRET
    clientSecret: 'iboaHVrf9xDgW05zEjIk6e4m7C1RqJl3',
  },
  // 小程序 APPID
  appId: 'wx478ba3c7380d0d51',
  // 正式环境接口地址
  baseApi: '',
  // 测试环境接口地址
  debugApi: '',
  // 静态资源根路径
  staticPath: 'https://c2b-res.oss-cn-shenzhen.aliyuncs.com/',
  // 获取token地址
  refreshApi: 'passport/oauth/token',
  // 微信登录
  passport: 'passport/oauth/wechat/miniapp',
  // 小程序权限
  permission: [],
  // 附加的工具类
  attachUtils: [],
  requestInterceptor: () => {
    return new Promise((resolve, reject) => {
      resolve();
    })
  }
}
