// +----------------------------------------------------------------------
// | 广西西途比网络科技有限公司 www.c2b666.com
// +----------------------------------------------------------------------
// | 功能描述: 我的订单
// +----------------------------------------------------------------------
// | 时　　间: 2020/06/09 10:59
// +----------------------------------------------------------------------
// | 代码创建: 廖惠琼 <861902371@qq.com>
// +----------------------------------------------------------------------
// | 版本信息: V1.0.0
// +----------------------------------------------------------------------
// | 代码修改:（修改人 - 时间）
// +----------------------------------------------------------------------
Page({

  /**
   * 页面的初始数据
   */
  data: {
    // 选中状态
  showId: 0,
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {
    this.selectComponent('#layout').finish();
  },

  onChange(event) {
    console.log(event.detail.name);
  },
  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },
  // 选项卡
  navClick(e) {
    this.setData({
      showId: e.currentTarget.dataset.type
    });
  },
  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  }
})
